Pippo98/Project/STM32F446RE/Libraries/Eagle_TRT.c
#include "Eagle_TRT.h"
//#include "inttypes.h"
//#include "stm32f4xx_hal.h"
//#include "stm32f4xx_hal_gpio.h"
#include "stm32f4xx_hal_conf.h"
//#include "string.h"
//#include "stdio.h"
//#include "stdlib.h"

/*
* Driver for all the stm in the Eagle_TRT veichle
* incude this driver in the main file
* you can't use all the functions unless you set up the CubeMx project correctly
*/

// to use encoder functions you have to initialize two timers, one for the clock and one to generate an interrupt
// to get the rotational speed of the encoder, you can setup the interrupt timer and call 'encoder_tim_interrupt()'
// you have to declare a variable and pass it as argument to the encoder_tim_interrupt() function
// the porpouse of that variable is to switch from the three phases needed to calculate the rotational speed
// the first and the second phases are to request two angles from the encoder, then third is to calculate the speed
// for the configuration of the first timer go to the description of the read_encoder() function
// for the configuration of the second timer you have to configure it to generate an interrupt
// that interrupt must be long enough to calculate a speed but not too long because you have to get the two angles in the same wheel rotation

///IMU VARIABLES///
uint8_t ZERO = 0x00;
uint8_t WHO_AM_I_G = 0x8F;
uint8_t WHO_AM_I_G_VAL;
uint8_t WHO_AM_I_XM = 0x8F;
uint8_t WHO_AM_I_XM_VAL;

uint8_t CTRL_REG1_G_ADD = 0x20;
uint8_t CTRL_REG1_G_VAL = 0x0F;
uint8_t CTRL_REG4_G_ADD = 0x23;
uint8_t CTRL_REG4_G_VAL = 0x10;

uint8_t CTRL_REG1_XM_ADD = 0x20;
uint8_t CTRL_REG1_XM_VAL = 0xA7;
uint8_t CTRL_REG2_XM_ADD = 0x21;
uint8_t CTRL_REG2_XM_VAL = 0x08;
uint8_t CTRL_REG5_XM_ADD = 0x24;
uint8_t CTRL_REG5_XM_VAL = 0x70;
uint8_t CTRL_REG6_XM_ADD = 0x25;
uint8_t CTRL_REG6_XM_VAL = 0x20;
uint8_t CTRL_REG7_XM_ADD = 0x26;
uint8_t CTRL_REG7_XM_VAL = 0x00;

uint8_t OUT_X_L_G_ADD = 0xE8;
uint8_t OUT_X_H_G_ADD = 0xE9;
uint8_t OUT_Y_L_G_ADD = 0xEA;
uint8_t OUT_Y_H_G_ADD = 0xEB;
uint8_t OUT_Z_L_G_ADD = 0xEC;
uint8_t OUT_Z_H_G_ADD = 0xED;

uint8_t OUT_X_L_A_ADD = 0xE8;
uint8_t OUT_X_H_A_ADD = 0xE9;
uint8_t OUT_Y_L_A_ADD = 0xEA;
uint8_t OUT_Y_H_A_ADD = 0xEB;
uint8_t OUT_Z_L_A_ADD = 0xEC;
uint8_t OUT_Z_H_A_ADD = 0xED;



#ifdef HAL_SPI_MODULE_ENABLED
#include "stm32f4xx_hal_spi.h"



//gyro initialization function
//call this function before requesting data from the sensor
void gyro_init(SPI_HandleTypeDef *hspi){
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); ///CS_G to 0
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET); ///CS_XM to 1
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG1_G_ADD, 1, 10); ///Writing the address
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG1_G_VAL, 1, 10); ///Writing 0b00001111 to enable PowerMode and x,y,z axis
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); ///CS_G to 1
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET); ///CS_XM to 0

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); ///CS_G to 0
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET); ///CS_XM to 1
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG4_G_ADD, 1, 10); ///Writing the address
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG4_G_VAL, 1, 10); ///Writing 0b00010000 to set full-scale selection to 500dps
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); ///CS_G to 1
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET); ///CS_XM to 0
}

//accelerometer and magnetometer initialization
//call this function before requesting data from the sensor
void magn_accel_init(SPI_HandleTypeDef *hspi){
	HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); ///CS_G to 1
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET); ///CS_XM to 0
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG1_XM_ADD, 1, 10); ///Writing the address
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG1_XM_VAL, 1, 10); ///Writing 0b10100111 to enable 1600Hz and x,y,z axis
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); ///CS_G to 0
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET); ///CS_XM to 1

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); ///CS_G to 1
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET); ///CS_XM to 0
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG2_XM_ADD, 1, 10); ///Writing the address
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG2_XM_VAL, 1, 10); ///Writing 0b00001000 to set +/-4g range for axel axis
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); ///CS_G to 0
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET); ///CS_XM to 1

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); ///CS_G to 1
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET); ///CS_XM to 0
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG5_XM_ADD, 1, 10); ///Writing the address
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG5_XM_VAL, 1, 10); ///Writing 0b01110000 to set high resolution for magn and 50Hz
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); ///CS_G to 0
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET); ///CS_XM to 1

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); ///CS_G to 1
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET); ///CS_XM to 0
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG6_XM_ADD, 1, 10); ///Writing the address
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG6_XM_VAL, 1, 10); ///Writing 0b00100000 to set +/-4 gauss range for magn axis
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); ///CS_G to 0
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET); ///CS_XM to 1

  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_SET); ///CS_G to 1
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET); ///CS_XM to 0
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG7_XM_ADD, 1, 10); ///Writing the address
  HAL_SPI_Transmit(hspi, (uint8_t*)&CTRL_REG7_XM_VAL, 1, 10); ///Writing 0b00000000 to set continuos conversion for magn axis
  HAL_GPIO_WritePin(GPIOA, GPIO_PIN_8, GPIO_PIN_RESET); ///CS_G to 0
  HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET); ///CS_XM to 1
}


//this function is used to calibrate the gyroscope
void gyro_calib(SPI_HandleTypeDef *hspi, float * X_G_axis_offset, float * Y_G_axis_offset, float * Z_G_axis_offset){
	float kp_G = 0.0175;
	*X_G_axis_offset = LSM9DS0_calib(hspi,GPIOA, GPIO_PIN_8, GPIOC, GPIO_PIN_9, OUT_X_L_G_ADD, OUT_X_H_G_ADD, kp_G);
	*Y_G_axis_offset = LSM9DS0_calib(hspi,GPIOA, GPIO_PIN_8, GPIOC, GPIO_PIN_9, OUT_Y_L_G_ADD, OUT_Y_H_G_ADD, kp_G);
	*Z_G_axis_offset = LSM9DS0_calib(hspi,GPIOA, GPIO_PIN_8, GPIOC, GPIO_PIN_9, OUT_Z_L_G_ADD, OUT_Z_H_G_ADD, kp_G);
}


//this function is used to calibrate the accelerometer
void accel_calib(SPI_HandleTypeDef *hspi, float * X_A_axis_offset, float * Y_A_axis_offset, float * Z_A_axis_offset){
	float kp_A = 0.00119782; ///0.000122 * 9,81
	*X_A_axis_offset = LSM9DS0_calib(hspi,GPIOC, GPIO_PIN_9, GPIOA, GPIO_PIN_8, OUT_X_L_A_ADD, OUT_X_H_A_ADD, kp_A);
	*Y_A_axis_offset = LSM9DS0_calib(hspi,GPIOC, GPIO_PIN_9, GPIOA, GPIO_PIN_8, OUT_Y_L_A_ADD, OUT_Y_H_A_ADD, kp_A);
	*Z_A_axis_offset = LSM9DS0_calib(hspi,GPIOC, GPIO_PIN_9, GPIOA, GPIO_PIN_8, OUT_Z_L_A_ADD, OUT_Z_H_A_ADD, kp_A);
}





float LSMD9S0_read(SPI_HandleTypeDef *hspi, GPIO_TypeDef* GPIOx_InUse, uint16_t GPIO_Pin_InUse, GPIO_TypeDef* GPIOx_NotInUse, uint16_t GPIO_Pin_NotInUse, uint8_t REG_L, uint8_t REG_H, float kp)
{
	uint8_t OUT_L_VAL;
	uint8_t OUT_H_VAL;

	///READING X_AXIS ROTATION
	HAL_GPIO_WritePin(GPIOx_InUse, GPIO_Pin_InUse, GPIO_PIN_RESET); ///CS_InUse to 0
	HAL_GPIO_WritePin(GPIOx_NotInUse, GPIO_Pin_NotInUse, GPIO_PIN_SET); ///CS_NotInUse to 1
	HAL_SPI_Transmit(hspi, &REG_L, 1, 10); ///Writing LOW address
	HAL_SPI_Receive(hspi, (uint8_t*)&OUT_L_VAL, 1, 10); ///Saving LOW data
	HAL_GPIO_WritePin(GPIOx_InUse, GPIO_Pin_InUse, GPIO_PIN_SET); ///CS_InUse to 1
	HAL_GPIO_WritePin(GPIOx_NotInUse, GPIO_Pin_NotInUse, GPIO_PIN_RESET); ///CS_NotInUse to 0


	HAL_GPIO_WritePin(GPIOx_InUse, GPIO_Pin_InUse, GPIO_PIN_RESET); ///CS_InUse to 0
	HAL_GPIO_WritePin(GPIOx_NotInUse, GPIO_Pin_NotInUse, GPIO_PIN_SET); ///CS_NotInUse to 1
	HAL_SPI_Transmit(hspi, &REG_H, 1, 10); ///Writing HIGH address
	HAL_SPI_Receive(hspi, (uint8_t*)&OUT_H_VAL, 1, 10); ///Saving HIGH data
	HAL_GPIO_WritePin(GPIOx_InUse, GPIO_Pin_InUse, GPIO_PIN_SET); ///CS_InUse to 1
	HAL_GPIO_WritePin(GPIOx_NotInUse, GPIO_Pin_NotInUse, GPIO_PIN_RESET); ///CS_NotInUse to 0

	///CALCULATING X_AXIS ROTATION
	float axis = OUT_H_VAL << 8 | OUT_L_VAL;	///Calculating axis value shifting and using a logic OR
	if (axis > 32767){ ///Generating positive and negative value of rotation
		axis = axis - 65536;
	}
	axis = axis * kp; ///Scaling axis value with appropriate conversion factor from datasheet

	return axis;
}

