Pippo98/Project/STM32F446RE/Libraries/Eagle_TRT.c
float LSM9DS0_calib(SPI_HandleTypeDef *hspi, GPIO_TypeDef* GPIOx_InUse, uint16_t GPIO_Pin_InUse, GPIO_TypeDef* GPIOx_NotInUse, uint16_t GPIO_Pin_NotInUse, uint8_t REG_L, uint8_t REG_H, float kp)
{
	float axis_cal;
	float sum_cal = 0.0000;
	for(int i = 0; i < 10000; i++){
		float tmp = LSMD9S0_read(hspi, GPIOx_InUse, GPIO_Pin_InUse, GPIOx_NotInUse, GPIO_Pin_NotInUse, REG_L, REG_H, kp);
		sum_cal = sum_cal + tmp;
	}
	axis_cal = sum_cal / 10000;
	return axis_cal;
}
int LSMD9S0_check(SPI_HandleTypeDef *hspi){
	int check = 0;

	///GYRO IS WORKING
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, GPIO_PIN_RESET); ///CS_G to 0
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11, GPIO_PIN_SET); ///CS_XM to 1
	HAL_SPI_Transmit(hspi, (uint8_t*)&WHO_AM_I_G, 1, 10); ///Writing on register ----> (uint8_t*) it's the cast of the pointer to WHO_AM_I_G (giving by &variable)
	HAL_SPI_TransmitReceive(hspi, (uint8_t*)&ZERO, (uint8_t*)&WHO_AM_I_G_VAL, 1, 10); ///Reading from register sending a 0x00
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, GPIO_PIN_SET); ///CS_G to 1
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11, GPIO_PIN_RESET); ///CS_XM to 0

	///AXEL/MAGN ARE WORKING
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, GPIO_PIN_SET); ///CS_G to 1
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11, GPIO_PIN_RESET); ///CS_XM to 0
	HAL_SPI_Transmit(hspi, (uint8_t*)&WHO_AM_I_XM, 1, 10); ///Writing on register ----> (uint8_t*) it's the cast of the pointer to WHO_AM_I_XM (giving by &variable)
	HAL_SPI_TransmitReceive(hspi, (uint8_t*)&ZERO, (uint8_t*)&WHO_AM_I_XM_VAL, 1, 10); ///Reading from register sending a 0x00
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_10, GPIO_PIN_RESET); ///CS_G to 0
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_11, GPIO_PIN_SET); ///CS_XM to 1

	///AXEL/GYRO STATUS
	if (WHO_AM_I_G_VAL != 212){
	check = 1;
	}
	if (WHO_AM_I_XM_VAL != 212){
	check = 2;
	}
	if ((WHO_AM_I_G_VAL != 212) & (WHO_AM_I_XM_VAL != 212)){
		check = 3;
	}

	return check;
}
///Reading G_axis values
void gyro_read(SPI_HandleTypeDef *hspi,float * X_G_axis, float * Y_G_axis, float * Z_G_axis, float *X_G_axis_offset,float * Y_G_axis_offset,float * Z_G_axis_offset){

	float kp_G = 0.0175;
	*X_G_axis = LSMD9S0_read(hspi,GPIOA, GPIO_PIN_8, GPIOC, GPIO_PIN_9, OUT_X_L_G_ADD, OUT_X_H_G_ADD, kp_G);
	*X_G_axis = X_G_axis - X_G_axis_offset;
	*Y_G_axis = LSMD9S0_read(hspi,GPIOA, GPIO_PIN_8, GPIOC, GPIO_PIN_9, OUT_Y_L_G_ADD, OUT_Y_H_G_ADD, kp_G);
	*Y_G_axis = Y_G_axis - Y_G_axis_offset;
	*Z_G_axis = LSMD9S0_read(hspi,GPIOA, GPIO_PIN_8, GPIOC, GPIO_PIN_9, OUT_Z_L_G_ADD, OUT_Z_H_G_ADD, kp_G);
	*Z_G_axis = Z_G_axis - Z_G_axis_offset;
}
///Reading A_axis values
void axel_read(SPI_HandleTypeDef *hspi,float * X_A_axis, float * Y_A_axis, float * Z_A_axis,float *X_A_axis_offset,float * Y_A_axis_offset,float * Z_A_axis_offset){
	float kp_A = 0.00119782; ///0.000122 * 9,81
	*X_A_axis = LSMD9S0_read(hspi,GPIOC, GPIO_PIN_9, GPIOA, GPIO_PIN_8, OUT_X_L_A_ADD, OUT_X_H_A_ADD, kp_A);
	*X_A_axis = X_A_axis - X_A_axis_offset;
	*Y_A_axis = LSMD9S0_read(hspi,GPIOC, GPIO_PIN_9, GPIOA, GPIO_PIN_8, OUT_Y_L_A_ADD, OUT_Y_H_A_ADD, kp_A);
	*Y_A_axis = Y_A_axis - Y_A_axis_offset;
	*Z_A_axis = LSMD9S0_read(hspi,GPIOC, GPIO_PIN_9, GPIOA, GPIO_PIN_8, OUT_Z_L_A_ADD, OUT_Z_H_A_ADD, kp_A);
	*Z_A_axis = Z_A_axis - Z_A_axis_offset + 9.81;
}

#endif


#ifdef HAL_CAN_MODULE_ENABLED
#include "stm32f4xx_hal_can.h"
//function that sends an array via CAN
//id = id of the message to be sent
//dataTx = the array that contains the data to be sent
//size = size of the array
int CAN_Send(CAN_HandleTypeDef *hcan,int id, uint8_t dataTx[], int size){

	uint32_t mailbox;
	uint8_t flag = 0;

	CAN_TxHeaderTypeDef TxHeader;
	TxHeader.StdId = id;
	TxHeader.IDE = CAN_ID_STD;
	TxHeader.RTR = CAN_RTR_DATA;
	TxHeader.DLC = size;
	TxHeader.TransmitGlobalTime = DISABLE;

	if (HAL_CAN_GetTxMailboxesFreeLevel(hcan) != 0 && HAL_CAN_IsTxMessagePending(hcan, CAN_TX_MAILBOX0) == 0){
		HAL_CAN_AddTxMessage(hcan, &TxHeader, dataTx, &mailbox);
		flag = 1;
	}

	return flag;
}


//receive a buffer from the CAN communication
//you can call this function in the callback of the CAN interrupt
//DataRx = pointer to the buffer you are receiveng
//size = size of the buffer you are using
int CAN_Receive(CAN_HandleTypeDef *hcan,uint8_t *DataRx, int size){
	CAN_RxHeaderTypeDef RxHeader;

	if (HAL_CAN_GetRxFifoFillLevel(hcan, CAN_RX_FIFO0) != 0){
		HAL_CAN_GetRxMessage(hcan, CAN_RX_FIFO0, &RxHeader, DataRx);
	}

	int id = RxHeader.StdId;

	return id;
}
#endif


//get the requested data from an NMEA string received from the GPS
//data_pos = position of the requested data
char* Get_Requested_Data(char * bufferRx, int data_pos, char * requested_data){
	int count = 0;
	int found = 0; //if data found 1 else 0
	int index = 0;

	//clear this buffer
	for(int i = 0; i < strlen(requested_data); i++){
		requested_data[i] = ' ';
	}

	for(int i = 0; i < strlen(bufferRx); i++){
		//count all the comma
		if(bufferRx[i] == ','){
			count++;
		}
		//the '-' is the last character in the input data
		if(bufferRx[i] == '-'){
			break;
		}

		if(found == 1){
			//until we find an another comma, add the data to the char
			if(bufferRx[i] == ','){
				return requested_data;
			}
			else{
				requested_data[index] = bufferRx[i];
				index ++;
			}
		}

		if(count == data_pos){
			found = 1;
		}

	}
	return "0";
}

//checks if the GPS is connected to some satellites
//if fix is 1 is connected if fix is 0 is not connected otherwise is -1 if I didn't found the data
int* Is_Valid(char * bufferRx, int * fix, char * requested_data){
	char* letter = Get_Requested_Data(bufferRx, 2, requested_data);

	if(*letter == 'A'){
		*fix = 1;
		return fix;
	}
	else{
		if(*letter == 'V'){
			*fix = 0;
			return fix;
		}
		else{
			*fix = -1;
			return fix;
		}
	}
}


//returns the number of the sentence found of the string given as argument
//bufferRX = string to be checked
//sentences = matrix of char in which the strings are saved
//len = length of the matrix sentences
//	0	1	2	3	4
//0	G	P	R	M	A
//1	G	P	R	M	C
//2 G	P	V	T	G
//3 G	P	V	B	W
//4 G	P	G	G	A
int Get_Sentence(char * bufferRx, char (*sentences)[5], int len){
	char sentence[5];
	int flag = 0;
	char * pointer;

	//check in the matrix where the strings are saved
	for(int i = 0; i < len; i++){
		for(int j = 0; j < 5; j++){
			sentence[j] = sentences[i][j];
		}

		if(strstr(bufferRx, sentence) != NULL){
			pointer = strstr(bufferRx, sentence);
			strcpy(bufferRx, pointer);

			flag = 1;
		}
		else{
			flag = 0;
			continue;
		}
		if(flag == 1){
			//return(i);

			if(i >= 0 && i <= len){
				return i;
			}
			else{
				return -1;
			}
			/*
			switch(i){
			case 0:
			return 0;  MX_USART1_USART_Init();

			break;
			case 1:
			return 1;
			break;
			case 2:
			return 2;
			break;
			case 3:
			return 3;
			break;
			case 4:
			return 4;
			break;
			default:
			return -1;
			break;
		}
		*/
	}
	else{
		continue;
	}
}

return -1;
}



