Pippo98/Project/STM32F446RE/Libraries/Eagle_TRT.c
#ifdef HAL_UART_MODULE_ENABLED
#include "stm32f4xx_hal_uart.h"

//print the given buffer
//huart = number of huart to be used
//text = char buffer to be sent
void print(UART_HandleTypeDef *huart, char* text){
	HAL_UART_Transmit(huart, (uint8_t*)text, strlen(text), 5);
	HAL_UART_Transmit(huart, (uint8_t*)"\r\n", 2, 1);

}


//function to initilize the GPS call it before requesting data from it
//to use this function, initialize a global int variable to 9600
//you have to put that variable in the huart Init function of the huart used for the GPS
//in particular you have to put it in the baudrate of the huart init function
//int his function that variable changes value from 9600 to 57600
//huart = huart at which GPS is connected
//baud = globl variable initilized to 9600
void GPS_INIT(UART_HandleTypeDef *huart){
	//default gps baud rate is 9600
	//set gps baud rate to 57600


	for(int i = 0; i < 50; i++){
		HAL_UART_Transmit(huart, (uint8_t*)PMTK_SET_BAUD_57600, strlen(PMTK_SET_BAUD_57600), 20);
		HAL_UART_Transmit(huart, (uint8_t*)"\r\n", 2, 4);
	}

	//change the baud rate of the stm to 57600
	HAL_Delay(50);
	//MX_USART1_UART_Init();
	huart->Init.BaudRate = 57600;
	if (HAL_UART_Init(huart) != HAL_OK)
	  {
	    _Error_Handler(__FILE__, __LINE__);
	  }

	//send other commands to speed up the data flow
	for(int i = 0; i < 50; i++){
		HAL_UART_Transmit(huart, (uint8_t*)PMTK_API_SET_FIX_CTL_5HZ, strlen(PMTK_API_SET_FIX_CTL_5HZ), 20);
		HAL_UART_Transmit(huart, (uint8_t*)"\r\n", 2, 4);
	}

	for(int i = 0; i < 50; i++){
		HAL_UART_Transmit(huart, (uint8_t*)PMTK_SET_NMEA_UPDATE_10HZ, strlen(PMTK_SET_NMEA_UPDATE_10HZ), 20);
		HAL_UART_Transmit(huart, (uint8_t*)"\r\n", 2, 4);
	}

	for(int i = 0; i < 50; i++){
		HAL_UART_Transmit(huart, (uint8_t*)PMTK_SET_NMEA_OUTPUT_ALLDATA, strlen(PMTK_SET_NMEA_OUTPUT_ALLDATA), 20);
		HAL_UART_Transmit(huart, (uint8_t*)"\r\n", 2, 4);
	}

	HAL_Delay(100);
}


//function to awake the GPS
void GPS_Awake(UART_HandleTypeDef *huart){
	for(int i = 0; i < 50; i++){
		HAL_UART_Transmit(huart, (uint8_t*)PMTK_AWAKE, strlen(PMTK_AWAKE), 20);
		HAL_UART_Transmit(huart, (uint8_t*)"\r\n", 2, 4);
	}
	for(int i = 0; i < 50; i++){
		HAL_UART_Transmit(huart, (uint8_t*)PMTK_Q_RELEASE, strlen(PMTK_Q_RELEASE), 20);
		HAL_UART_Transmit(huart, (uint8_t*)"\r\n", 2, 4);
	}
}
#endif



#ifdef HAL_TIM_MODULE_ENABLED
#include "stm32f4xx_hal_tim.h"

//function to request data from encoder via SSI communication
//this function is called from the interrupt callback of the timer that you are using for the encoder
//the tim used for this function must be initialized at most at 2 microsecond per tick
//lower the number of microseconds per tick better it is
//TimerInstance = struct of the tim used for the encoder
double read_encoder(TIM_HandleTypeDef *TimerInstance){
	int clock_loop = 16;
	double int_data = 0;
	int clock_period = 2;
	int Data[50];

	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET);	//clock was high: reset to low
	__HAL_TIM_SET_COUNTER(TimerInstance, 0);			//delay of 1 microsecond like from datasheet
	while(__HAL_TIM_GET_COUNTER(TimerInstance) <= clock_period){
	}
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);	//clock set to high to request the bit
	__HAL_TIM_SET_COUNTER(TimerInstance, 0);			//delay of 1 microsecond like from datasheet
	while(__HAL_TIM_GET_COUNTER(TimerInstance) <= clock_period){
	}
	HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET);	//clock was high: reset to low

	for(int i = 0; i < clock_loop; i++){
		HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);	//clock set to high to request the bit

		__HAL_TIM_SET_COUNTER(TimerInstance, 0);			//delay of 1 microsecond like from datasheet
		while(__HAL_TIM_GET_COUNTER(TimerInstance) <= clock_period){
		}

		if(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_8) == GPIO_PIN_SET && i <= 15){	//reading the data input
			Data[i] = 1;
		}
		else{
			Data[i] = 0;
		}

		if(i == clock_loop-1){												//if it is the last loop set the clock pin to high, else set to low
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_SET);

			__HAL_TIM_SET_COUNTER(TimerInstance, 0);			//delay of 20 microsecond like from datasheet
			while(__HAL_TIM_GET_COUNTER(TimerInstance) <= 40){
			}
		}
		else{
			HAL_GPIO_WritePin(GPIOC, GPIO_PIN_9, GPIO_PIN_RESET);
		}

		__HAL_TIM_SET_COUNTER(TimerInstance, 0);					//delay of anothe 1 micros like from datasheet
		while(__HAL_TIM_GET_COUNTER(TimerInstance) <= clock_period){
		}

		if(i == 15){												//if it is the last loop cast the sata from binary to decimal
			int_data = bin_dec(Data);

			//sprintf(txt, "%d", (int)int_data);

			int_data = int_data / 45.5055;							//conversions from raw data to angle
			int_data /= 2;

			//Error = Data[15];										//If 0 no error, if 1 the encoder is unplugged

			//sprintf(txt, "%d7891", (int)int_data);
			//sprintf(txt, "%d%d%d%d%d%d%d%d%d%d%d%d%d%d%d%d", Data[0], Data[1], Data[2], Data[3], Data[4], Data[5], Data[6], Data[7], Data[8], Data[9], Data[10], Data[11], Data[12], Data[13], Data[14], Data[15]);
			//print(txt);
		}

	}
	return int_data;
}


//interrupt function of tim 2
//call this function in the timer callback function of the stm
//htim = timer TimerInstance of the timer that you are using for the clock of the encoder
void encoder_tim_interrupt(TIM_HandleTypeDef *htim, int * interrupt_flag, double * angles_array, double * speed){
	double average_speed = 0;
	if(*interrupt_flag == 0){									//every 3 times request the angle from encoder
		angles_array[0] = read_encoder(htim);
		interrupt_flag ++;
	}
	else{
		if(*interrupt_flag == 1){									//every 3 times request the angle from encoder
			angles_array[1] = read_encoder(htim);
			interrupt_flag++;
		}
		else{
			if(*interrupt_flag == 2){									//calculate the speed from the two last angles
				double Speed = get_speed_encoder(angles_array[0], angles_array[1],1000,0.4064);
				if(abs(Speed - speed[8]) <= abs(speed[8] * 10)){			//exclude the wrong speeds
					shift_array(speed, 15, Speed);
					average_speed = dynamic_average(speed, 15);
				}
				*interrupt_flag = 0;
			}
		}
	}
}

int implausibility_check(TIM_HandleTypeDef *TimerInstance, int * Val0_100, int * Val1_100){

	int SCS1 = 0;

	if (*Val0_100 >= 100){
		  *Val0_100 = 100;
	  }
	  if (*Val0_100 <= 5){
		  *Val0_100 = 0;
	  }

	  if (*Val1_100 >= 100){
		  *Val1_100 = 100;
	  }
	  if (*Val1_100 <= 5){
		  *Val1_100 = 0;
	  }

	if(abs(*Val0_100 - *Val1_100) >= 10){
		if(__HAL_TIM_GET_COUNTER(TimerInstance) > 100){
			SCS1 = 1;
		}
	}
	else{
		__HAL_TIM_SET_COUNTER(TimerInstance, 0);
		SCS1 = 0;
	}

	return SCS1;
}

#endif


//function to calculate the decimal value from binary MSB array
int bin_dec(int* bin){
	int dec = 0;
	int max = 15;

	for(int i = 0; i < max; i++){
		if(bin[i] == 1){
			dec += Power(2, max-i-1);
		}
	}

