Pippo98/Project/STM32F446RE/Libraries/Eagle_TRT.c
	return dec;
}


//function to calculate the power of a given number
double Power(int base, int expn){
	double result = 1;
	if(expn != 0){
		for(int j = 0; j < expn; j++){
			result = result * base;
		}
	}

	return result;
}


//shift all the data of a numeric array and add another one value
//array = array to be shifted
//size = size of the array
//data = value to be added in the last position of the array
void shift_array(double *array, int size, double data){
	for(int i = 1; i < size; i++){
		array[i-1] = array[i];
	}
	array[size-1] = data;
}


//funtion to calculate the speed
//angle0 = last angle calculated
//angle1 = previous angle calculated
//refresh = delta-time from the two calculations, express it in microseconds
//wheel_diameter = diameter of the wheel expressed meters
double get_speed_encoder(float angle0, float angle1, int refresh, float wheel_diameter){
	double meters_per_second = 0;
	double dt = 0;

	dt = refresh / 1000000;
	meters_per_second = ((angle0 - angle1)/360)*3.14159265359*(wheel_diameter);			//calculating the speed using the circumference arc
	meters_per_second /= dt;

	//sprintf(txt, "%d", (int)(speed[9]*100));
	//print(txt);

	return meters_per_second;
}



//function that calculate the average of all the numbers in one array
double dynamic_average(double *array, int size){
	double sum = 0;
	double average = 0;

	for(int i = 0; i < size; i++){
		sum += array[i];
	}
	average = sum / size;

	return average;
}
void calc_pot_value(int max, int min, int range, float * val0_100, int * val){
	*val0_100 = (int)100-(abs(val[0] - min)*100/(range)); //val0_100 -->STEER --> 0 = SX | 100 = DX
    if (val[0] <= min){
      *val0_100 = 100;
    }
    if (val[0] >= max){
      *val0_100 = 0;
    }
}

